<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>关于重载、隐藏、重写的一些思考（2） | coordinate</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  
  <meta name="keywords" content="cppoverloadoverridenamehiding" />
  
  
    <meta name="google-site-verification" content="true" />
  
  
    <meta name="baidu-site-verification" content="true" />
  
  
    <meta name="360-site-verification" content="true" />
  
  <meta name="description" content="关于重载、隐藏、重写的一些思考（1）内容我们谈到了override，我说它和namehiding看上去很相似。我们先验证一下，它是否有namehiding的一些特征，并且又有哪些不同。 1234567891011121314151617class Base&amp;#123;public:	virtual void func1() = 0;	virtual void func2();	virtual vo">
<meta name="keywords" content="cpp,overload,override,namehiding">
<meta property="og:type" content="article">
<meta property="og:title" content="关于重载、隐藏、重写的一些思考（2）">
<meta property="og:url" content="http://coordinate.wang/2017/11/04/2017-11-4-关于重载、隐藏、重写的一些思考（2）/index.html">
<meta property="og:site_name" content="coordinate">
<meta property="og:description" content="关于重载、隐藏、重写的一些思考（1）内容我们谈到了override，我说它和namehiding看上去很相似。我们先验证一下，它是否有namehiding的一些特征，并且又有哪些不同。 1234567891011121314151617class Base&amp;#123;public:	virtual void func1() = 0;	virtual void func2();	virtual vo">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="http://wx2.sinaimg.cn/mw690/af2d2659ly1fl85n9oxzrj20q00c274j.jpg">
<meta property="og:updated_time" content="2018-02-18T03:29:07.469Z">

<figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Base</span></span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span> </span>= <span class="number">0</span>;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">()</span></span>;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">(<span class="keyword">int</span>)</span></span>;	<span class="comment">//重载</span></span><br><span class="line">	<span class="function"><span class="keyword">void</span> <span class="title">func3</span><span class="params">()</span></span>;</span><br><span class="line">	<span class="function"><span class="keyword">void</span> <span class="title">func3</span><span class="params">(<span class="keyword">int</span>)</span></span>;			<span class="comment">//重载</span></span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Derived</span>:</span> <span class="keyword">public</span> Base</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="keyword">using</span> Base::func3;			<span class="comment">//新加入</span></span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func1</span><span class="params">()</span></span>;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">func2</span><span class="params">()</span></span>;		</span><br><span class="line">	<span class="function"><span class="keyword">void</span> <span class="title">func3</span><span class="params">()</span></span>;</span><br><span class="line">	<span class="function"><span class="keyword">void</span> <span class="title">func4</span><span class="params">()</span></span>;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">d.func3();		<span class="comment">//调用Base::func3()</span></span><br></pre></td></tr></table></figure>
<p>嗯，我们似乎做的不错，我们也可以这样去调用<code>Base::func3()</code></p>
<figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">d.Base::func3();	<span class="comment">//调用Base::func3()</span></span><br></pre></td></tr></table></figure>
<p>这些都恰恰说明了，隐藏仅仅是隐藏，它原来的东西还是有的，并没有消失。接着我们再看看发生override的<code>func2</code> ，当我们这样去做的时候</p>
<figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">d.Base::func2();	 <span class="comment">//调用Base::func2()&lt;--------------</span></span><br><span class="line">d.Base::func2(<span class="number">3</span>);	 <span class="comment">//调用Base::func2(int)&lt;-----------</span></span><br></pre></td></tr></table></figure>
<p>ok，我们很愉快的看到了override和namehiding在这一点上又有了相似的特性。</p>
<p>我们再通过之前的一个<a href="http://blog.csdn.net/qq_17550379/article/details/78097310" target="_blank" rel="noopener">小技巧</a>，查看类的结构。</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class Base	size(4):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| &#123;vfptr&#125;</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  Base::$vftable@:</span><br><span class="line">1&gt;  	| &amp;Base_meta</span><br><span class="line">1&gt;  	|  0</span><br><span class="line">1&gt;   0	| &amp;Base::func1</span><br><span class="line">1&gt;   1	| &amp;Base::func2</span><br><span class="line">1&gt;   2	| &amp;Base::func2</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  Base::func1 this adjustor: 0</span><br><span class="line">1&gt;  Base::func2 this adjustor: 0</span><br><span class="line">1&gt;  Base::func2 this adjustor: 0</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  class Derived	size(4):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| +--- (base class Base)</span><br><span class="line">1&gt;   0	| | &#123;vfptr&#125;</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  Derived::$vftable@:</span><br><span class="line">1&gt;  	| &amp;Derived_meta</span><br><span class="line">1&gt;  	|  0</span><br><span class="line">1&gt;   0	| &amp;Derived::func1</span><br><span class="line">1&gt;   1	| &amp;Base::func2</span><br><span class="line">1&gt;   2	| &amp;Derived::func2</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  Derived::func1 this adjustor: 0</span><br><span class="line">1&gt;  Derived::func2 this adjustor: 0</span><br></pre></td></tr></table></figure>
<p>Derived虚函数表继承了Base虚函数表里面的所有函数，但是又对之前说的override的函数都进行自己的本地化，都变成了Derived自己的函数，这个过程是一种<strong>改写</strong>的过程。</p>
<p>很多奇怪的问题就不难理解了。诸如上面的</p>
