<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>深度探索c++对象模型(4) | coordinate</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  
  <meta name="keywords" content="cpp" />
  
  
  
  
  <meta name="description" content="从最简单的问题开始1234class X&amp;#123;&amp;#125;;class Y:virtual public X&amp;#123;&amp;#125;;class Z:virtual public X&amp;#123;&amp;#125;;class A:public Y, public Z&amp;#123;&amp;#125;; 每个类的大小是多少呢？我在vs2015上面的得到的答案是这样的（这里我使用了一个小技巧，在vs中，在项目—">
<meta name="keywords" content="cpp">
<meta property="og:type" content="article">
<meta property="og:title" content="深度探索c++对象模型(4)">
<meta property="og:url" content="http://coordinate.wang/2017/08/07/2017-08-07-深度探索c++对象模型(4)/index.html">
<meta property="og:site_name" content="coordinate">
<meta property="og:description" content="从最简单的问题开始1234class X&amp;#123;&amp;#125;;class Y:virtual public X&amp;#123;&amp;#125;;class Z:virtual public X&amp;#123;&amp;#125;;class A:public Y, public Z&amp;#123;&amp;#125;; 每个类的大小是多少呢？我在vs2015上面的得到的答案是这样的（这里我使用了一个小技巧，在vs中，在项目—">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="http://wx1.sinaimg.cn/mw690/af2d2659ly1fjhxrdubfjj20je0f0gm0.jpg">
<meta property="og:updated_time" content="2018-02-18T03:29:07.107Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="深度探索c++对象模型(4)">

          <section id="main" style="float:none;"><article id="post-2017-08-07-深度探索c++对象模型(4)" style="width: 66%; float:left;" class="article article-type-post" itemscope itemprop="blogPost" >
  <div id="articleInner" class="clearfix post-1016 post type-post status-publish format-standard has-post-thumbnail hentry category-template-2 category-uncategorized tag-codex tag-edge-case tag-featured-image tag-image tag-template">
    
    
      <header class="article-header">
        
  
    <h1 class="thumb" class="article-title" itemprop="name">
      深度探索c++对象模型(4)
    </h1>
  

      </header>
    
    <div class="article-meta">
      
	<a href="/2017/08/07/2017-08-07-深度探索c++对象模型(4)/" class="article-date">
	  <time datetime="2017-08-06T16:00:00.000Z" itemprop="datePublished">八月 7, 2017</time>
	</a>

      
	<span class="ico-folder"></span>
    <a class="article-category-link" href="/categories/cpp/">cpp</a>
 
      
	<span id="busuanzi_container_page_pv">
	  本文总阅读量<span id="busuanzi_value_page_pv"></span>次
	</span>

    </div>
    <div class="article-entry" itemprop="articleBody">
      
        <h2 id="从最简单的问题开始"><a href="#从最简单的问题开始" class="headerlink" title="从最简单的问题开始"></a>从最简单的问题开始</h2><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">X</span>&#123;</span>&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Y</span>:</span><span class="keyword">virtual</span> <span class="keyword">public</span> X&#123;&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Z</span>:</span><span class="keyword">virtual</span> <span class="keyword">public</span> X&#123;&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span>:</span><span class="keyword">public</span> Y, <span class="keyword">public</span> Z&#123;&#125;;</span><br></pre></td></tr></table></figure>
<p>每个类的大小是多少呢？我在vs2015上面的得到的答案是这样的（这里我使用了一个小技巧，在vs中，在项目——属性——配置属性——C/C++——命令行——其他选项中添加选项“/d1reportAllClassLayout”。再次编译时候，编译器会输出所有定义类的对象模型。）</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class X	size(1):</span><br><span class="line">1&gt;  class Y	size(4):</span><br><span class="line">1&gt;   0	| &#123;vbptr&#125;</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;  	+--- (virtual base X)</span><br><span class="line">1&gt;  class Z	size(4):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| &#123;vbptr&#125;</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;  	+--- (virtual base X)</span><br><span class="line">1&gt;  class A	size(8):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| +--- (base class Y)</span><br><span class="line">1&gt;   0	| | &#123;vbptr&#125;</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;   4	| +--- (base class Z)</span><br><span class="line">1&gt;   4	| | &#123;vbptr&#125;</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;  	+--- (virtual base X)</span><br></pre></td></tr></table></figure>
<p>我们可以看到这里的X的大小是1，这是被编译器安插进去的一个char。这使得class的两个不同的对象可以在内存中得到不同的地址。</p>
<p>我们再来看Y和Z。首先我们要明白的是实现虚继承，将要带来一些额外的负担——额外需要一个某种形式的指针。到目前为止，对于一个32位的机器来说Y、Z的大小应该为5，而不是8或者4。我们需要再考虑两点因素：内存对齐（alignment）和编译器的优化。</p>
<p>考虑内存对齐的原因，Y和Z的大小会增加到4的倍数，也就是相应的补齐3bytes。但是在现在大多数的编译器上做了这样的一个优化处理。因为既然我的类里面有了成员，那么就不需要为空的类按插一个char，那么这是类的大小就是4，所以也就不用3bytes去填补，所以最终Y和Z的大小就是4。关于内存对齐的问题，我不准备在本文展开。大家有兴趣可以参看我的另一篇文章<a href="">关于内存对齐的总结</a></p>
<h2 id="关于单继承问题"><a href="#关于单继承问题" class="headerlink" title="关于单继承问题"></a>关于单继承问题</h2><p>我们先考虑一个简单的问题，单一继承并且没有virtual function</p>
<figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">X</span> </span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line">	<span class="keyword">int</span> x;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Y</span> :</span><span class="keyword">public</span> X </span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> y;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>得到的结果是</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class X	size(4):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| x</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  class Y	size(8):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| +--- (base class X)</span><br><span class="line">1&gt;   0	| | x</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;   4	| y</span><br><span class="line">1&gt;  	+---</span><br></pre></td></tr></table></figure>
<p>不能看出子类中继承了父类的成员，现在我们在此基础上增加一个虚函数看看</p>
<figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">X</span> </span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line">	<span class="keyword">int</span> x;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funX</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Y</span> :</span><span class="keyword">public</span> X </span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> y;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funY</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>结果为</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class X	size(8):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| &#123;vfptr&#125;</span><br><span class="line">1&gt;   4	| x</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  X::$vftable@:</span><br><span class="line">1&gt;  	| &amp;X_meta</span><br><span class="line">1&gt;  	|  0</span><br><span class="line">1&gt;   0	| &amp;X::funX</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  X::funX this adjustor: 0</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  class Y	size(12):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| +--- (base class X)</span><br><span class="line">1&gt;   0	| | &#123;vfptr&#125;</span><br><span class="line">1&gt;   4	| | x</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;   8	| y</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  Y::$vftable@:</span><br><span class="line">1&gt;  	| &amp;Y_meta</span><br><span class="line">1&gt;  	|  0</span><br><span class="line">1&gt;   0	| &amp;X::funX</span><br><span class="line">1&gt;   1	| &amp;Y::funY</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  Y::funY this adjustor: 0</span><br></pre></td></tr></table></figure>
<p>注意这个结果里面多出来了一个东西vftable很明显这个根据字面意思可以知道，这是虚函数指针对应的虚函数表。这里还有另一个东西adjustor，这是什么？</p>
<p>adjustor表示虚函数机制执行时，this指针的调整量，假如fun被多态调用的话，那么它的形式如下：</p>
<p>*(this+0)[0]()</p>
<p>总结虚函数调用形式，应该是：</p>
<p>*(this指针+调整量)[虚函数在vftable内的偏移]()</p>
<p>还有最后这个结果中要说的最后一点是，关于vfptr的位置问题，如你所见，在vs2015中它是被编译器放在了类的最前面，但是不是所有的编译器都是这样的。ok，开始下一个话题。</p>
<h2 id="多重继承问题"><a href="#多重继承问题" class="headerlink" title="多重继承问题"></a>多重继承问题</h2><p>依然从最简单的开始，不考虑virtual function</p>
<figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">X</span> </span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line">	<span class="keyword">int</span> x;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Y</span> :</span><span class="keyword">public</span> X </span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> y;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Z</span> :</span><span class="keyword">public</span> X</span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> z;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span> :</span><span class="keyword">public</span> Y, <span class="keyword">public</span> Z</span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> a;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>结果是</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class X	size(4):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| x</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  class Y	size(8):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| +--- (base class X)</span><br><span class="line">1&gt;   0	| | x</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;   4	| y</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  class Z	size(8):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| +--- (base class X)</span><br><span class="line">1&gt;   0	| | x</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;   4	| z</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  class A	size(20):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| +--- (base class Y)</span><br><span class="line">1&gt;   0	| | +--- (base class X)</span><br><span class="line">1&gt;   0	| | | x</span><br><span class="line">1&gt;  	| | +---</span><br><span class="line">1&gt;   4	| | y</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;   8	| +--- (base class Z)</span><br><span class="line">1&gt;   8	| | +--- (base class X)</span><br><span class="line">1&gt;   8	| | | x</span><br><span class="line">1&gt;  	| | +---</span><br><span class="line">1&gt;  12	| | z</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;  16	| a</span><br><span class="line">1&gt;  	+---</span><br></pre></td></tr></table></figure>
<p>我们这里注意到A的大小是20，结合结构图不难理解，好，现在增加virtual function</p>
<figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">X</span> </span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line">	<span class="keyword">int</span> x;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funX</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Y</span> :</span><span class="keyword">public</span> X </span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> y;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funY</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Z</span> :</span><span class="keyword">public</span> X</span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> z;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funZ</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span> :</span><span class="keyword">public</span> Y, <span class="keyword">public</span> Z</span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> a;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funY</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funZ</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>结果是</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br></pre></td><td class="code"><pre><span class="line">1&gt;  class X	size(8):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| &#123;vfptr&#125;</span><br><span class="line">1&gt;   4	| x</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  X::$vftable@:</span><br><span class="line">1&gt;  	| &amp;X_meta</span><br><span class="line">1&gt;  	|  0</span><br><span class="line">1&gt;   0	| &amp;X::funX</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  X::funX this adjustor: 0</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  class Y	size(12):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| +--- (base class X)</span><br><span class="line">1&gt;   0	| | &#123;vfptr&#125;</span><br><span class="line">1&gt;   4	| | x</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;   8	| y</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  Y::$vftable@:</span><br><span class="line">1&gt;  	| &amp;Y_meta</span><br><span class="line">1&gt;  	|  0</span><br><span class="line">1&gt;   0	| &amp;X::funX</span><br><span class="line">1&gt;   1	| &amp;Y::funY</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  Y::funY this adjustor: 0</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  class Z	size(12):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| +--- (base class X)</span><br><span class="line">1&gt;   0	| | &#123;vfptr&#125;</span><br><span class="line">1&gt;   4	| | x</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;   8	| z</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  Z::$vftable@:</span><br><span class="line">1&gt;  	| &amp;Z_meta</span><br><span class="line">1&gt;  	|  0</span><br><span class="line">1&gt;   0	| &amp;X::funX</span><br><span class="line">1&gt;   1	| &amp;Z::funZ</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  Z::funZ this adjustor: 0</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  class A	size(28):</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;   0	| +--- (base class Y)</span><br><span class="line">1&gt;   0	| | +--- (base class X)</span><br><span class="line">1&gt;   0	| | | &#123;vfptr&#125;</span><br><span class="line">1&gt;   4	| | | x</span><br><span class="line">1&gt;  	| | +---</span><br><span class="line">1&gt;   8	| | y</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;  12	| +--- (base class Z)</span><br><span class="line">1&gt;  12	| | +--- (base class X)</span><br><span class="line">1&gt;  12	| | | &#123;vfptr&#125;</span><br><span class="line">1&gt;  16	| | | x</span><br><span class="line">1&gt;  	| | +---</span><br><span class="line">1&gt;  20	| | z</span><br><span class="line">1&gt;  	| +---</span><br><span class="line">1&gt;  24	| a</span><br><span class="line">1&gt;  	+---</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  A::$vftable@Y@:</span><br><span class="line">1&gt;  	| &amp;A_meta</span><br><span class="line">1&gt;  	|  0</span><br><span class="line">1&gt;   0	| &amp;X::funX</span><br><span class="line">1&gt;   1	| &amp;A::funY</span><br><span class="line">1&gt;   2	| &amp;A::funA</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  A::$vftable@Z@:</span><br><span class="line">1&gt;  	| -12</span><br><span class="line">1&gt;   0	| &amp;X::funX</span><br><span class="line">1&gt;   1	| &amp;A::funZ</span><br><span class="line">1&gt;</span><br><span class="line">1&gt;  A::funA this adjustor: 0</span><br><span class="line">1&gt;  A::funY this adjustor: 0</span><br><span class="line">1&gt;  A::funZ this adjustor: 12</span><br></pre></td></tr></table></figure>
<p>这里出现一个有意思的问题，在多重继承下，子类有两个虚函数表，分别来自两个父类，其中一个虚函数表中包含了子类的虚函数，而另一个没有。如果子类重写了任意父类的虚函数，都会覆盖对应的函数地址记录。</p>
<p>在这里我们发现A::funZ的函数对应的adjustor值是12，按照我们前边的规则，可以发现该函数的多态调用形式为：</p>
<p>*(this+12)[1]()</p>
<p>此处的调整量12正好是Z的vfptr在A对象内的偏移量。</p>
<p>这里我们注意到在子类A中有两个X，分别是Y中的X和Z中的X，这种做法我们认为是对内存的一种浪费，怎么解决这个问题呢？就引出了虚拟继承。</p>
<h2 id="虚拟继承"><a href="#虚拟继承" class="headerlink" title="虚拟继承"></a>虚拟继承</h2><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">X</span> </span></span><br><span class="line"><span class="class">&#123;</span></span><br><span class="line">	<span class="keyword">int</span> x;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funX</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Y</span> :</span><span class="keyword">virtual</span> <span class="keyword">public</span> X </span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> y;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funY</span><span class="params">()</span></span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Z</span> :</span><span class="keyword">virtual</span> <span class="keyword">public</span> X</span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> z;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funZ</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span> :</span><span class="keyword">public</span> Y, <span class="keyword">public</span> Z</span><br><span class="line">&#123;</span><br><span class="line">	<span class="keyword">int</span> a;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funY</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">	<span class="function"><span class="keyword">virtual</span> <span class="keyword">void</span> <span class="title">funZ</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>结果是</p>
